public class Main {
    public static void main(String[] args) {
        int a=200;//0000 0000 0000 0000 0000 0000 1100 1000
        int b=10; //0000 0000 0000 0000 0000 0000 0000 1010
        //此时&表示逻辑与，0为false，1为true
        //0000 0000 0000 0000 0000 0000 1100 1000
        //0000 0000 0000 0000 0000 0000 0000 1010
        //————————————————————————————————————————
        //0000 0000 0000 0000 0000 0000 0000 1000
        //因为逻辑与同真结果为真，所以便可求
        //计算可得0000 0000 0000 0000 0000 0000 0000 1000的十进制数为8
        System.out.println(a&b);//8
        System.out.println(a|b);//同理
        System.out.println(a<<2);
        //0000 0000 0000 0000 0000 0011 0010 0000
        //结果为800
        //<<:二进制的补码向左移动，低位补零
        System.out.println(a>>2);
        //0000 0000 0000 0000 0000 0000 0011 0010
        //>>:右移，高位补0或者1
        //补的数要根据符号来判断如果原数为正数，则符号位补零，其余补零
        //如果原数为负数则符号位补1，其余补零
        int g=-100;
        System.out.println(g>>>2);
        System.out.println(a>>>2);
        //无符号右移>>>:向右移动，高位补零




    }
}